{
    "title": "B-harvest SDK development funding",
    "description": "# Summary\nThe CANTO hub proposes to bring on B-Harvest as core/client developers for Canto. This engagement would entail the payment of NOTE (Canto’s native stablecoin) or CANTO +10% (to account for volatility) in exchange for B-Harvest’s services and contributions.\n\nB-Harvest is an established team within the Cosmos ecosystem. They were the original developers of the core liquidity module (Gravity Dex) and were the first to introduce concentrated liquidity in the form of an SDK module. As an original genesis validator on the Cosmos Hub, B-Harvest is a leading validator across multiple major Cosmos ecosystem networks, and its team has a long track record of high-quality and timely delivery of key Cosmos development objectives. While Canto utilizes the EVM for its execution logic, the blockchain logic is built on the Cosmos SDK. A contributor like B-Harvest will enable the Canto Hub to implement timely chain upgrades alongside the development of new modules.\n\n# Funding and Terms\n\nThe B-Harvest team is requesting funding at costs + 50% from the CANTO hub per year to cover the OPEX required to execute the scope of work mentioned below.\n\nThe first year will be at $1.3 Million in CANTO, paid in one payment for the first year, and paid quarterly in subsequent years. The payment can be done either by an equivalent value in NOTE (Canto’s stablecoin) or CANTO with 10% more provided to account for volatility. Subsequent years may be higher if costs rise over time, and will be capped at $1.5 Million per year.\n\nIn a parallel transaction, for long-term economic alignment, a portion of the CANTO genesis block that was set aside for contributors will be transferred to the B-Harvest team over the next three years.\n\nAny subsequent modifications in scope and/or terms to this framework as currently proposed will be signaled on-chain via governance as incurred throughout the duration of this contribution arrangement.\n\n# Statement of Work\n\nThe funding for this proposal will be used for:\n* Hiring, managing, and training 1 architect and 4 developers (2 Cosmos SDK and 2 Solidity). Hiring these developers would take a maximum of 2 months, and the training another 2 months respectively. Actual development contribution to Canto can be expected by January 2023 assuming a lead time to recruiting.\n* Liquid Staking Protocol: B-Harvest will develop an Ethereum staking protocol living on Canto that will become part of Canto’s Free Public Infrastructure.\n* Chain Upgrades: Research, development, and coordination of chain upgrades so that Canto is always running the latest Ethermint + Cosmos chain versions.\n* Performance Improvements: Researching and implementation of performance improvements to Tendermint core that can later be applied to Canto.\n\nAmount to be sent from community pool: 12,871,287 CANTO\n\nTo wallet: canto1m452mgup53jtp458l0zaqj2ap6swwk2hv62g3e",
    "recipient": "canto1m452mgup53jtp458l0zaqj2ap6swwk2hv62g3e",
    "amount": "12871287000000000000000000ucanto",
    "deposit": "100000000000000000000ucanto"
  }